midian4536/si4455-pic24-rf/trn/si4455_defs.h
#define SI4455_CMD_ID_POWER_UP 0x02
// POWER_UP ARGS
#define SI4455_CMD_ARG_COUNT_POWER_UP 7
#define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_TYPE bitfield
#define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_SIZE 8
#define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_MASK 0xFF
#define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_MSB 7
#define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_LSB 0
#define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_INDEX 1
#define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_value (((cmd.arg.RAW[1])))
#define SI4455_CMD_POWER_UP_ARG_PATCH_TYPE bitfield
#define SI4455_CMD_POWER_UP_ARG_PATCH_SIZE 1
#define SI4455_CMD_POWER_UP_ARG_PATCH_MASK 0x80
#define SI4455_CMD_POWER_UP_ARG_PATCH_BIT 0x80
#define SI4455_CMD_POWER_UP_ARG_PATCH_MSB 7
#define SI4455_CMD_POWER_UP_ARG_PATCH_LSB 7
#define SI4455_CMD_POWER_UP_ARG_PATCH_INDEX 1
#define SI4455_CMD_POWER_UP_ARG_PATCH_is_true (cmd.arg.RAW[1] & 0x80)
#define SI4455_CMD_POWER_UP_ARG_PATCH_value (((cmd.arg.RAW[1] & 0x80)) >> 7)
#define SI4455_CMD_POWER_UP_ARG_FUNC_TYPE bitfield
#define SI4455_CMD_POWER_UP_ARG_FUNC_SIZE 6
#define SI4455_CMD_POWER_UP_ARG_FUNC_MASK 0x3F
#define SI4455_CMD_POWER_UP_ARG_FUNC_MSB 5
#define SI4455_CMD_POWER_UP_ARG_FUNC_LSB 0
#define SI4455_CMD_POWER_UP_ARG_FUNC_INDEX 1
#define SI4455_CMD_POWER_UP_ARG_FUNC_value (((cmd.arg.RAW[1] & 0x3F)))
#define SI4455_CMD_POWER_UP_ARG_FUNC_ENUM_BOOT 0
#define SI4455_CMD_POWER_UP_ARG_FUNC_ENUM_MAIN 1
#define SI4455_CMD_POWER_UP_ARG_FUNC_ENUM_LOADED 63
#define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_TYPE bitfield
#define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_SIZE 8
#define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_MASK 0xFF
#define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_MSB 7
#define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_LSB 0
#define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_INDEX 2
#define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_value (((cmd.arg.RAW[2])))
#define SI4455_CMD_POWER_UP_ARG_TCXO_TYPE bitfield
#define SI4455_CMD_POWER_UP_ARG_TCXO_SIZE 1
#define SI4455_CMD_POWER_UP_ARG_TCXO_MASK 0x01
#define SI4455_CMD_POWER_UP_ARG_TCXO_BIT 0x01
#define SI4455_CMD_POWER_UP_ARG_TCXO_MSB 0
#define SI4455_CMD_POWER_UP_ARG_TCXO_LSB 0
#define SI4455_CMD_POWER_UP_ARG_TCXO_INDEX 2
#define SI4455_CMD_POWER_UP_ARG_TCXO_is_true (cmd.arg.RAW[2] & 0x1)
#define SI4455_CMD_POWER_UP_ARG_TCXO_value (((cmd.arg.RAW[2] & 0x1)))
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_TYPE u32
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_SIZE 32
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MASK 0xFFFFFFFF
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MSB 31
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_LSB 0
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_INDEX 3
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_value (((cmd.arg.RAW_u32[0])))
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MIN 25000000
#define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MAX 32000000
// POWER_UP REPLY
#define SI4455_CMD_REPLY_COUNT_POWER_UP 0

#define SI4455_CMD_ID_TEST_DATA 0x09
// TEST_DATA ARGS
#define SI4455_CMD_ARG_COUNT_TEST_DATA 2
#define SI4455_CMD_TEST_DATA_ARG_OFFSET_TYPE u8
#define SI4455_CMD_TEST_DATA_ARG_OFFSET_SIZE 8
#define SI4455_CMD_TEST_DATA_ARG_OFFSET_MASK 0xFF
#define SI4455_CMD_TEST_DATA_ARG_OFFSET_MSB 7
#define SI4455_CMD_TEST_DATA_ARG_OFFSET_LSB 0
#define SI4455_CMD_TEST_DATA_ARG_OFFSET_INDEX 1
#define SI4455_CMD_TEST_DATA_ARG_OFFSET_value (((cmd.arg.RAW[1])))
// TEST_DATA REPLY
#define SI4455_CMD_REPLY_COUNT_TEST_DATA 16
#define SI4455_CMD_TEST_DATA_REP_TEST0_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST0_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST0_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST0_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST0_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST0_INDEX 1
#define SI4455_CMD_TEST_DATA_REP_TEST1_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST1_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST1_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST1_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST1_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST1_INDEX 2
#define SI4455_CMD_TEST_DATA_REP_TEST2_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST2_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST2_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST2_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST2_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST2_INDEX 3
#define SI4455_CMD_TEST_DATA_REP_TEST3_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST3_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST3_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST3_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST3_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST3_INDEX 4
#define SI4455_CMD_TEST_DATA_REP_TEST4_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST4_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST4_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST4_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST4_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST4_INDEX 5
#define SI4455_CMD_TEST_DATA_REP_TEST5_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST5_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST5_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST5_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST5_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST5_INDEX 6
#define SI4455_CMD_TEST_DATA_REP_TEST6_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST6_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST6_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST6_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST6_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST6_INDEX 7
#define SI4455_CMD_TEST_DATA_REP_TEST7_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST7_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST7_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST7_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST7_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST7_INDEX 8
#define SI4455_CMD_TEST_DATA_REP_TEST8_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST8_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST8_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST8_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST8_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST8_INDEX 9
#define SI4455_CMD_TEST_DATA_REP_TEST9_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TEST9_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TEST9_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TEST9_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TEST9_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TEST9_INDEX 10
#define SI4455_CMD_TEST_DATA_REP_TESTA_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TESTA_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TESTA_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TESTA_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TESTA_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TESTA_INDEX 11
#define SI4455_CMD_TEST_DATA_REP_TESTB_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TESTB_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TESTB_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TESTB_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TESTB_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TESTB_INDEX 12
#define SI4455_CMD_TEST_DATA_REP_TESTC_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TESTC_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TESTC_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TESTC_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TESTC_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TESTC_INDEX 13
#define SI4455_CMD_TEST_DATA_REP_TESTD_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TESTD_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TESTD_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TESTD_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TESTD_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TESTD_INDEX 14
#define SI4455_CMD_TEST_DATA_REP_TESTE_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TESTE_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TESTE_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TESTE_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TESTE_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TESTE_INDEX 15
#define SI4455_CMD_TEST_DATA_REP_TESTF_TYPE u8
#define SI4455_CMD_TEST_DATA_REP_TESTF_SIZE 8
#define SI4455_CMD_TEST_DATA_REP_TESTF_MASK 0xFF
#define SI4455_CMD_TEST_DATA_REP_TESTF_MSB 7
#define SI4455_CMD_TEST_DATA_REP_TESTF_LSB 0
#define SI4455_CMD_TEST_DATA_REP_TESTF_INDEX 16

#define SI4455_CMD_ID_FUNC_INFO 0x10
// FUNC_INFO ARGS
#define SI4455_CMD_ARG_COUNT_FUNC_INFO 1
// FUNC_INFO REPLY
#define SI4455_CMD_REPLY_COUNT_FUNC_INFO 11
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_TYPE u8
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_SIZE 8
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_MASK 0xFF
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_MSB 7
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_INDEX 1
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_MIN 0
#define SI4455_CMD_FUNC_INFO_REP_REVEXT_MAX 255
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_TYPE u8
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_SIZE 8
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_MASK 0xFF
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_MSB 7
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_INDEX 2
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_MIN 0
#define SI4455_CMD_FUNC_INFO_REP_REVBRANCH_MAX 255
#define SI4455_CMD_FUNC_INFO_REP_REVINT_TYPE u8
#define SI4455_CMD_FUNC_INFO_REP_REVINT_SIZE 8
#define SI4455_CMD_FUNC_INFO_REP_REVINT_MASK 0xFF
#define SI4455_CMD_FUNC_INFO_REP_REVINT_MSB 7
#define SI4455_CMD_FUNC_INFO_REP_REVINT_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_REVINT_INDEX 3
#define SI4455_CMD_FUNC_INFO_REP_REVINT_MIN 0
#define SI4455_CMD_FUNC_INFO_REP_REVINT_MAX 255
#define SI4455_CMD_FUNC_INFO_REP_PATCH_TYPE u16
#define SI4455_CMD_FUNC_INFO_REP_PATCH_SIZE 16
#define SI4455_CMD_FUNC_INFO_REP_PATCH_MASK 0xFFFF
#define SI4455_CMD_FUNC_INFO_REP_PATCH_MSB 15
#define SI4455_CMD_FUNC_INFO_REP_PATCH_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_PATCH_INDEX 4
#define SI4455_CMD_FUNC_INFO_REP_FUNC_TYPE u8
#define SI4455_CMD_FUNC_INFO_REP_FUNC_SIZE 8
#define SI4455_CMD_FUNC_INFO_REP_FUNC_MASK 0xFF
#define SI4455_CMD_FUNC_INFO_REP_FUNC_MSB 7
#define SI4455_CMD_FUNC_INFO_REP_FUNC_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_FUNC_INDEX 6
#define SI4455_CMD_FUNC_INFO_REP_FUNC_ENUM_BOOT 0
#define SI4455_CMD_FUNC_INFO_REP_FUNC_ENUM_MAIN 1
#define SI4455_CMD_FUNC_INFO_REP_SVNFLAGS_TYPE bitfield
#define SI4455_CMD_FUNC_INFO_REP_SVNFLAGS_SIZE 8
#define SI4455_CMD_FUNC_INFO_REP_SVNFLAGS_MASK 0xFF
#define SI4455_CMD_FUNC_INFO_REP_SVNFLAGS_MSB 7
#define SI4455_CMD_FUNC_INFO_REP_SVNFLAGS_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_SVNFLAGS_INDEX 7
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_TYPE bitfield
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_SIZE 2
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_MASK 0x30
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_MSB 5
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_LSB 4
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_INDEX 7
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_ENUM_TAG 0
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_ENUM_BRANCH 1
#define SI4455_CMD_FUNC_INFO_REP_LOCATION_ENUM_TRUNK 2
#define SI4455_CMD_FUNC_INFO_REP_MIXEDREV_TYPE bitfield
#define SI4455_CMD_FUNC_INFO_REP_MIXEDREV_SIZE 1
#define SI4455_CMD_FUNC_INFO_REP_MIXEDREV_MASK 0x02
#define SI4455_CMD_FUNC_INFO_REP_MIXEDREV_BIT 0x02
#define SI4455_CMD_FUNC_INFO_REP_MIXEDREV_MSB 1
#define SI4455_CMD_FUNC_INFO_REP_MIXEDREV_LSB 1
#define SI4455_CMD_FUNC_INFO_REP_MIXEDREV_INDEX 7
#define SI4455_CMD_FUNC_INFO_REP_LOCALMOD_TYPE bitfield
#define SI4455_CMD_FUNC_INFO_REP_LOCALMOD_SIZE 1
#define SI4455_CMD_FUNC_INFO_REP_LOCALMOD_MASK 0x01
#define SI4455_CMD_FUNC_INFO_REP_LOCALMOD_BIT 0x01
#define SI4455_CMD_FUNC_INFO_REP_LOCALMOD_MSB 0
#define SI4455_CMD_FUNC_INFO_REP_LOCALMOD_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_LOCALMOD_INDEX 7
#define SI4455_CMD_FUNC_INFO_REP_SVNREV_TYPE u32
#define SI4455_CMD_FUNC_INFO_REP_SVNREV_SIZE 32
#define SI4455_CMD_FUNC_INFO_REP_SVNREV_MASK 0xFFFFFFFF
#define SI4455_CMD_FUNC_INFO_REP_SVNREV_MSB 31
#define SI4455_CMD_FUNC_INFO_REP_SVNREV_LSB 0
#define SI4455_CMD_FUNC_INFO_REP_SVNREV_INDEX 8

#define SI4455_CMD_ID_SET_PROPERTY 0x11
// SET_PROPERTY ARGS
#define SI4455_CMD_ARG_COUNT_SET_PROPERTY 16
#define SI4455_CMD_SET_PROPERTY_ARG_GROUP_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_GROUP_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_GROUP_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_GROUP_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_GROUP_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_GROUP_INDEX 1
#define SI4455_CMD_SET_PROPERTY_ARG_GROUP_value (((cmd.arg.RAW[1])))
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_INDEX 2
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_value (((cmd.arg.RAW[2])))
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_MIN 1
#define SI4455_CMD_SET_PROPERTY_ARG_NUM_PROPS_MAX 12
#define SI4455_CMD_SET_PROPERTY_ARG_START_PROP_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_START_PROP_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_START_PROP_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_START_PROP_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_START_PROP_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_START_PROP_INDEX 3
#define SI4455_CMD_SET_PROPERTY_ARG_START_PROP_value (((cmd.arg.RAW[3])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA0_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA0_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA0_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA0_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA0_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA0_INDEX 4
#define SI4455_CMD_SET_PROPERTY_ARG_DATA0_value (((cmd.arg.RAW[4])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA1_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA1_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA1_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA1_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA1_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA1_INDEX 5
#define SI4455_CMD_SET_PROPERTY_ARG_DATA1_value (((cmd.arg.RAW[5])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA2_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA2_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA2_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA2_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA2_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA2_INDEX 6
#define SI4455_CMD_SET_PROPERTY_ARG_DATA2_value (((cmd.arg.RAW[6])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA3_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA3_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA3_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA3_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA3_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA3_INDEX 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA3_value (((cmd.arg.RAW[7])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA4_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA4_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA4_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA4_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA4_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA4_INDEX 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA4_value (((cmd.arg.RAW[8])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA5_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA5_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA5_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA5_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA5_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA5_INDEX 9
#define SI4455_CMD_SET_PROPERTY_ARG_DATA5_value (((cmd.arg.RAW[9])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA6_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA6_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA6_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA6_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA6_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA6_INDEX 10
#define SI4455_CMD_SET_PROPERTY_ARG_DATA6_value (((cmd.arg.RAW[10])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA7_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA7_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA7_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA7_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA7_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA7_INDEX 11
#define SI4455_CMD_SET_PROPERTY_ARG_DATA7_value (((cmd.arg.RAW[11])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA8_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA8_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA8_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA8_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA8_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA8_INDEX 12
#define SI4455_CMD_SET_PROPERTY_ARG_DATA8_value (((cmd.arg.RAW[12])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA9_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA9_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA9_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA9_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA9_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA9_INDEX 13
#define SI4455_CMD_SET_PROPERTY_ARG_DATA9_value (((cmd.arg.RAW[13])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA10_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA10_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA10_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA10_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA10_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA10_INDEX 14
#define SI4455_CMD_SET_PROPERTY_ARG_DATA10_value (((cmd.arg.RAW[14])))
#define SI4455_CMD_SET_PROPERTY_ARG_DATA11_TYPE u8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA11_SIZE 8
#define SI4455_CMD_SET_PROPERTY_ARG_DATA11_MASK 0xFF
#define SI4455_CMD_SET_PROPERTY_ARG_DATA11_MSB 7
#define SI4455_CMD_SET_PROPERTY_ARG_DATA11_LSB 0
#define SI4455_CMD_SET_PROPERTY_ARG_DATA11_INDEX 15
#define SI4455_CMD_SET_PROPERTY_ARG_DATA11_value (((cmd.arg.RAW[15])))
// SET_PROPERTY REPLY
#define SI4455_CMD_REPLY_COUNT_SET_PROPERTY 0

#define SI4455_CMD_ID_GET_PROPERTY 0x12
// GET_PROPERTY ARGS
#define SI4455_CMD_ARG_COUNT_GET_PROPERTY 4
#define SI4455_CMD_GET_PROPERTY_ARG_GROUP_TYPE u8
#define SI4455_CMD_GET_PROPERTY_ARG_GROUP_SIZE 8
#define SI4455_CMD_GET_PROPERTY_ARG_GROUP_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_ARG_GROUP_MSB 7
#define SI4455_CMD_GET_PROPERTY_ARG_GROUP_LSB 0
#define SI4455_CMD_GET_PROPERTY_ARG_GROUP_INDEX 1
#define SI4455_CMD_GET_PROPERTY_ARG_GROUP_value (((cmd.arg.RAW[1])))
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_TYPE u8
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_SIZE 8
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_MSB 7
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_LSB 0
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_INDEX 2
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_value (((cmd.arg.RAW[2])))
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_MIN 1
#define SI4455_CMD_GET_PROPERTY_ARG_NUM_PROPS_MAX 16
#define SI4455_CMD_GET_PROPERTY_ARG_START_PROP_TYPE u8
#define SI4455_CMD_GET_PROPERTY_ARG_START_PROP_SIZE 8
#define SI4455_CMD_GET_PROPERTY_ARG_START_PROP_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_ARG_START_PROP_MSB 7
#define SI4455_CMD_GET_PROPERTY_ARG_START_PROP_LSB 0
#define SI4455_CMD_GET_PROPERTY_ARG_START_PROP_INDEX 3
#define SI4455_CMD_GET_PROPERTY_ARG_START_PROP_value (((cmd.arg.RAW[3])))
// GET_PROPERTY REPLY
#define SI4455_CMD_REPLY_COUNT_GET_PROPERTY 16
#define SI4455_CMD_GET_PROPERTY_REP_DATA0_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA0_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA0_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA0_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA0_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA0_INDEX 1
#define SI4455_CMD_GET_PROPERTY_REP_DATA1_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA1_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA1_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA1_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA1_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA1_INDEX 2
#define SI4455_CMD_GET_PROPERTY_REP_DATA2_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA2_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA2_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA2_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA2_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA2_INDEX 3
#define SI4455_CMD_GET_PROPERTY_REP_DATA3_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA3_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA3_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA3_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA3_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA3_INDEX 4
#define SI4455_CMD_GET_PROPERTY_REP_DATA4_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA4_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA4_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA4_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA4_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA4_INDEX 5
#define SI4455_CMD_GET_PROPERTY_REP_DATA5_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA5_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA5_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA5_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA5_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA5_INDEX 6
#define SI4455_CMD_GET_PROPERTY_REP_DATA6_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA6_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA6_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA6_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA6_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA6_INDEX 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA7_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA7_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA7_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA7_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA7_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA7_INDEX 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA8_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA8_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA8_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA8_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA8_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA8_INDEX 9
#define SI4455_CMD_GET_PROPERTY_REP_DATA9_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA9_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA9_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA9_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA9_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA9_INDEX 10
#define SI4455_CMD_GET_PROPERTY_REP_DATA10_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA10_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA10_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA10_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA10_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA10_INDEX 11
#define SI4455_CMD_GET_PROPERTY_REP_DATA11_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA11_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA11_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA11_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA11_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA11_INDEX 12
#define SI4455_CMD_GET_PROPERTY_REP_DATA12_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA12_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA12_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA12_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA12_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA12_INDEX 13
#define SI4455_CMD_GET_PROPERTY_REP_DATA13_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA13_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA13_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA13_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA13_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA13_INDEX 14
#define SI4455_CMD_GET_PROPERTY_REP_DATA14_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA14_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA14_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA14_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA14_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA14_INDEX 15
#define SI4455_CMD_GET_PROPERTY_REP_DATA15_TYPE u8
#define SI4455_CMD_GET_PROPERTY_REP_DATA15_SIZE 8
#define SI4455_CMD_GET_PROPERTY_REP_DATA15_MASK 0xFF
#define SI4455_CMD_GET_PROPERTY_REP_DATA15_MSB 7
#define SI4455_CMD_GET_PROPERTY_REP_DATA15_LSB 0
#define SI4455_CMD_GET_PROPERTY_REP_DATA15_INDEX 16

