midian4536/si4455-pic24-rf/trn/si4455_defs.h
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DONOTHING 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TRISTATE 1
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DRIVE0 2
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DRIVE1 3
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_INPUT 4
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_SDO 11
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_POR 12
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_DATA_CLK 16
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_DATA_CLK 17
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_DATA 19
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_DATA 20
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_RAW_DATA 21
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_VALID_PREAMBLE 24
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_SYNC_WORD_DETECT 26
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_STATE 32
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_STATE 33
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_FIFO_FULL 34
#define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_FIFO_EMPTY 35
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_SIZE 8
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_MASK 0xFF
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_MSB 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_LSB 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_INDEX 5
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_SIZE 1
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_MASK 0x80
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_BIT 0x80
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_MSB 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_LSB 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_INDEX 5
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_SIZE 6
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_MASK 0x3F
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_MSB 5
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_LSB 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_INDEX 5
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DONOTHING 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TRISTATE 1
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DRIVE0 2
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DRIVE1 3
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_INPUT 4
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_SDO 11
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_POR 12
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TX_DATA_CLK 16
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_DATA_CLK 17
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TX_DATA 19
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_DATA 20
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_RAW_DATA 21
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_VALID_PREAMBLE 24
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_SYNC_WORD_DETECT 26
#define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_NIRQ 39
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_SIZE 8
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_MASK 0xFF
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_MSB 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_LSB 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_INDEX 6
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_SIZE 1
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_MASK 0x80
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_BIT 0x80
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_MSB 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_LSB 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_INDEX 6
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_SIZE 6
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_MASK 0x3F
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_MSB 5
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_LSB 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_INDEX 6
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DONOTHING 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TRISTATE 1
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DRIVE0 2
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DRIVE1 3
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_INPUT 4
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_SDO 11
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_POR 12
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TX_DATA_CLK 16
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_DATA_CLK 17
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TX_DATA 19
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_DATA 20
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_RAW_DATA 21
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_VALID_PREAMBLE 24
#define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_SYNC_WORD_DETECT 26
#define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_SIZE 8
#define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_MASK 0xFF
#define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_MSB 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_LSB 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_INDEX 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_TYPE bitfield
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_SIZE 2
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_MASK 0x60
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_MSB 6
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_LSB 5
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_INDEX 7
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_HIGH 0
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_MED_HIGH 1
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_MED_LOW 2
#define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_LOW 3

#define SI4455_CMD_ID_GET_ADC_READING 0x14
// GET_ADC_READING ARGS
#define SI4455_CMD_ARG_COUNT_GET_ADC_READING 3
// GET_ADC_READING REPLY
#define SI4455_CMD_REPLY_COUNT_GET_ADC_READING 8

#define SI4455_CMD_ID_FIFO_INFO 0x15
// FIFO_INFO ARGS
#define SI4455_CMD_ARG_COUNT_FIFO_INFO 2
#define SI4455_CMD_FIFO_INFO_ARG_FIFO_TYPE bitfield
#define SI4455_CMD_FIFO_INFO_ARG_FIFO_SIZE 8
#define SI4455_CMD_FIFO_INFO_ARG_FIFO_MASK 0xFF
#define SI4455_CMD_FIFO_INFO_ARG_FIFO_MSB 7
#define SI4455_CMD_FIFO_INFO_ARG_FIFO_LSB 0
#define SI4455_CMD_FIFO_INFO_ARG_FIFO_INDEX 1
#define SI4455_CMD_FIFO_INFO_ARG_FIFO_value (((cmd.arg.RAW[1])))
#define SI4455_CMD_FIFO_INFO_ARG_RX_TYPE bitfield
#define SI4455_CMD_FIFO_INFO_ARG_RX_SIZE 1
#define SI4455_CMD_FIFO_INFO_ARG_RX_MASK 0x02
#define SI4455_CMD_FIFO_INFO_ARG_RX_BIT 0x02
#define SI4455_CMD_FIFO_INFO_ARG_RX_MSB 1
#define SI4455_CMD_FIFO_INFO_ARG_RX_LSB 1
#define SI4455_CMD_FIFO_INFO_ARG_RX_INDEX 1
#define SI4455_CMD_FIFO_INFO_ARG_RX_is_true (cmd.arg.RAW[1] & 0x2)
#define SI4455_CMD_FIFO_INFO_ARG_RX_value (((cmd.arg.RAW[1] & 0x2)) >> 1)
#define SI4455_CMD_FIFO_INFO_ARG_RX_ENUM_FALSE 0
#define SI4455_CMD_FIFO_INFO_ARG_RX_ENUM_TRUE 1
#define SI4455_CMD_FIFO_INFO_ARG_TX_TYPE bitfield
#define SI4455_CMD_FIFO_INFO_ARG_TX_SIZE 1
#define SI4455_CMD_FIFO_INFO_ARG_TX_MASK 0x01
#define SI4455_CMD_FIFO_INFO_ARG_TX_BIT 0x01
#define SI4455_CMD_FIFO_INFO_ARG_TX_MSB 0
#define SI4455_CMD_FIFO_INFO_ARG_TX_LSB 0
#define SI4455_CMD_FIFO_INFO_ARG_TX_INDEX 1
#define SI4455_CMD_FIFO_INFO_ARG_TX_is_true (cmd.arg.RAW[1] & 0x1)
#define SI4455_CMD_FIFO_INFO_ARG_TX_value (((cmd.arg.RAW[1] & 0x1)))
#define SI4455_CMD_FIFO_INFO_ARG_TX_ENUM_FALSE 0
#define SI4455_CMD_FIFO_INFO_ARG_TX_ENUM_TRUE 1
// FIFO_INFO REPLY
#define SI4455_CMD_REPLY_COUNT_FIFO_INFO 2
#define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_TYPE u8
#define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_SIZE 8
#define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_MASK 0xFF
#define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_MSB 7
#define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_LSB 0
#define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_INDEX 1
#define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_TYPE u8
#define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_SIZE 8
#define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_MASK 0xFF
#define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_MSB 7
#define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_LSB 0
#define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_INDEX 2

