midian4536/si4455-pic24-rf/trn/si4455_defs.h
#define SI4455_PROP_INT_CTL_PH_ENABLE_MASK 0xFF
#define SI4455_PROP_INT_CTL_PH_ENABLE_DEFAULT 0x00
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_SIZE 1
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_LSB 5
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_MSB 5
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_MASK 0x20
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_BIT 0x20
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_SIZE 1
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_LSB 4
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_MSB 4
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_MASK 0x10
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_BIT 0x10
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_SIZE 1
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_LSB 3
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_MSB 3
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_MASK 0x8
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_BIT 0x8
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_SIZE 1
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_LSB 1
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_MSB 1
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_MASK 0x2
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_BIT 0x2
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_SIZE 1
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_LSB 0
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_MSB 0
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_MASK 0x1
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_BIT 0x1

#define SI4455_PROP_INT_CTL_MODEM_ENABLE_MASK 0xFF
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_DEFAULT 0x00
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_SIZE 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_LSB 6
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_MSB 6
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_MASK 0x40
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_BIT 0x40
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_SIZE 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_LSB 5
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_MSB 5
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_MASK 0x20
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_BIT 0x20
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_SIZE 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_LSB 4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_MSB 4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_MASK 0x10
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_BIT 0x10
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_SIZE 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_LSB 3
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_MSB 3
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_MASK 0x8
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_BIT 0x8
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_SIZE 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_LSB 2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_MSB 2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_MASK 0x4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_BIT 0x4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_SIZE 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_LSB 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_MSB 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_MASK 0x2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_BIT 0x2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_SIZE 1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_LSB 0
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_MSB 0
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_MASK 0x1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_BIT 0x1

#define SI4455_PROP_INT_CTL_CHIP_ENABLE_MASK 0xFF
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_DEFAULT 0x04
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_SIZE 1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_LSB 6
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_MSB 6
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_MASK 0x40
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_BIT 0x40
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_SIZE 1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_LSB 5
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_MSB 5
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_MASK 0x20
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_BIT 0x20
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_SIZE 1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_LSB 4
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_MSB 4
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_MASK 0x10
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_BIT 0x10
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_SIZE 1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_LSB 3
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_MSB 3
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_MASK 0x8
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_BIT 0x8
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_SIZE 1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_LSB 2
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_MSB 2
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_MASK 0x4
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_BIT 0x4

#define SI4455_PROP_FRR_CTL_A_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_A_MODE_DEFAULT 0x01
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_SIZE 8
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_LSB 0
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_MSB 7
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_DISABLED 0
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_STATUS 1
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_PEND 2
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_PH_STATUS 3
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_PH_PEND 4
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_MODEM_STATUS 5
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_MODEM_PEND 6
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_CHIP_STATUS 7
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_CHIP_PEND 8
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_CURRENT_STATE 9
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_LATCHED_RSSI 10
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE0 11
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE1 12
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE2 13
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE3 14
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE4 15
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE5 16
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE6 17

#define SI4455_PROP_FRR_CTL_B_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_B_MODE_DEFAULT 0x02
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_SIZE 8
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_LSB 0
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_MSB 7
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_DISABLED 0
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_STATUS 1
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_PEND 2
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_PH_STATUS 3
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_PH_PEND 4
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_MODEM_STATUS 5
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_MODEM_PEND 6
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_CHIP_STATUS 7
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_CHIP_PEND 8
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_CURRENT_STATE 9
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_LATCHED_RSSI 10
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE0 11
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE1 12
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE2 13
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE3 14
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE4 15
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE5 16
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE6 17

