midian4536/si4455-pic24-rf/trn/si4455_defs.h
#define SI4455_PROP_FRR_CTL_C_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_C_MODE_DEFAULT 0x09
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_SIZE 8
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_LSB 0
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_MSB 7
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_DISABLED 0
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_STATUS 1
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_PEND 2
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_PH_STATUS 3
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_PH_PEND 4
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_MODEM_STATUS 5
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_MODEM_PEND 6
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_CHIP_STATUS 7
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_CHIP_PEND 8
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_CURRENT_STATE 9
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_LATCHED_RSSI 10
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE0 11
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE1 12
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE2 13
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE3 14
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE4 15
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE5 16
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE6 17

#define SI4455_PROP_FRR_CTL_D_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_D_MODE_DEFAULT 0x00
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_SIZE 8
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_LSB 0
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_MSB 7
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_MASK 0xFF
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_DISABLED 0
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_STATUS 1
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_PEND 2
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_PH_STATUS 3
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_PH_PEND 4
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_MODEM_STATUS 5
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_MODEM_PEND 6
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_CHIP_STATUS 7
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_CHIP_PEND 8
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_CURRENT_STATE 9
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_LATCHED_RSSI 10
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE0 11
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE1 12
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE2 13
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE3 14
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE4 15
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE5 16
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE6 17

#define SI4455_PROP_SYNC_BITS_31_24_MASK 0xFF
#define SI4455_PROP_SYNC_BITS_31_24_DEFAULT 0x2D
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_SIZE 8
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_LSB 0
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MSB 7
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MIN 0
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MAX 0xff
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MASK 0xFF

#define SI4455_PROP_SYNC_BITS_23_16_MASK 0xFF
#define SI4455_PROP_SYNC_BITS_23_16_DEFAULT 0xD4
#define SI4455_PROP_SYNC_BITS_23_16_BITS_23_16_SIZE 8
#define SI4455_PROP_SYNC_BITS_23_16_BITS_23_16_LSB 0
#define SI4455_PROP_SYNC_BITS_23_16_BITS_23_16_MSB 7
#define SI4455_PROP_SYNC_BITS_23_16_BITS_23_16_MIN 0
#define SI4455_PROP_SYNC_BITS_23_16_BITS_23_16_MAX 0xff
#define SI4455_PROP_SYNC_BITS_23_16_BITS_23_16_MASK 0xFF

#define SI4455_PROP_SYNC_BITS_15_8_MASK 0xFF
#define SI4455_PROP_SYNC_BITS_15_8_DEFAULT 0x2D
#define SI4455_PROP_SYNC_BITS_15_8_BITS_15_8_SIZE 8
#define SI4455_PROP_SYNC_BITS_15_8_BITS_15_8_LSB 0
#define SI4455_PROP_SYNC_BITS_15_8_BITS_15_8_MSB 7
#define SI4455_PROP_SYNC_BITS_15_8_BITS_15_8_MIN 0
#define SI4455_PROP_SYNC_BITS_15_8_BITS_15_8_MAX 0xff
#define SI4455_PROP_SYNC_BITS_15_8_BITS_15_8_MASK 0xFF

#define SI4455_PROP_SYNC_BITS_7_0_MASK 0xFF
#define SI4455_PROP_SYNC_BITS_7_0_DEFAULT 0xD4
#define SI4455_PROP_SYNC_BITS_7_0_BITS_7_0_SIZE 8
#define SI4455_PROP_SYNC_BITS_7_0_BITS_7_0_LSB 0
#define SI4455_PROP_SYNC_BITS_7_0_BITS_7_0_MSB 7
#define SI4455_PROP_SYNC_BITS_7_0_BITS_7_0_MIN 0
#define SI4455_PROP_SYNC_BITS_7_0_BITS_7_0_MAX 0xff
#define SI4455_PROP_SYNC_BITS_7_0_BITS_7_0_MASK 0xFF

#define SI4455_PROP_PA_PWR_LVL_MASK 0xFF
#define SI4455_PROP_PA_PWR_LVL_DEFAULT 0x7F
#define SI4455_PROP_PA_PWR_LVL_DDAC_SIZE 7
#define SI4455_PROP_PA_PWR_LVL_DDAC_LSB 0
#define SI4455_PROP_PA_PWR_LVL_DDAC_MSB 6
#define SI4455_PROP_PA_PWR_LVL_DDAC_MIN 0
#define SI4455_PROP_PA_PWR_LVL_DDAC_MAX 127
#define SI4455_PROP_PA_PWR_LVL_DDAC_MASK 0x7F

#define SI4455_PROP_PA_BIAS_CLKDUTY_MASK 0xFF
#define SI4455_PROP_PA_BIAS_CLKDUTY_DEFAULT 0x00
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_SIZE 2
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_LSB 6
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_MSB 7
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_MASK 0xC0
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_DIFF_50 0
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_DIFF_25 1
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_SINGLE_50 2
#define SI4455_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_SINGLE_25 3
#define SI4455_PROP_PA_BIAS_CLKDUTY_OB_SIZE 6
#define SI4455_PROP_PA_BIAS_CLKDUTY_OB_LSB 0
#define SI4455_PROP_PA_BIAS_CLKDUTY_OB_MSB 5
#define SI4455_PROP_PA_BIAS_CLKDUTY_OB_MIN 0
#define SI4455_PROP_PA_BIAS_CLKDUTY_OB_MAX 63
#define SI4455_PROP_PA_BIAS_CLKDUTY_OB_MASK 0x3F

#define SI4455_PROP_PA_TC_MASK 0xFF
#define SI4455_PROP_PA_TC_DEFAULT 0x5D
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_SIZE 3
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_LSB 5
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_MSB 7
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_MASK 0xE0
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_2_US 0
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_6_US 1
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_10_US 2
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_14_US 3
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_18_US 4
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_22_US 5
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_26_US 6
#define SI4455_PROP_PA_TC_FSK_MOD_DLY_ENUM_30_US 7
#define SI4455_PROP_PA_TC_TC_SIZE 5
#define SI4455_PROP_PA_TC_TC_LSB 0
#define SI4455_PROP_PA_TC_TC_MSB 4
#define SI4455_PROP_PA_TC_TC_MIN 0
#define SI4455_PROP_PA_TC_TC_MAX 31
#define SI4455_PROP_PA_TC_TC_MASK 0x1F

#define SI4455_PROP_PA_RAMP_EX_MASK 0xFF
#define SI4455_PROP_PA_RAMP_EX_DEFAULT 0x00
#define SI4455_PROP_PA_RAMP_EX_VSET_SIZE 4
#define SI4455_PROP_PA_RAMP_EX_VSET_LSB 4
#define SI4455_PROP_PA_RAMP_EX_VSET_MSB 7
#define SI4455_PROP_PA_RAMP_EX_VSET_MIN 0
#define SI4455_PROP_PA_RAMP_EX_VSET_MAX 15
#define SI4455_PROP_PA_RAMP_EX_VSET_MASK 0xF0
#define SI4455_PROP_PA_RAMP_EX_TC_SIZE 4
#define SI4455_PROP_PA_RAMP_EX_TC_LSB 0
#define SI4455_PROP_PA_RAMP_EX_TC_MSB 3
#define SI4455_PROP_PA_RAMP_EX_TC_MIN 0
#define SI4455_PROP_PA_RAMP_EX_TC_MAX 15
#define SI4455_PROP_PA_RAMP_EX_TC_MASK 0xF

#define SI4455_PROP_PA_RAMP_DOWN_DELAY_MASK 0xFF
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_DEFAULT 0x23
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_SIZE 8
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_LSB 0
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MSB 7
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MIN 1
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MAX 40
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MASK 0xFF

