midian4536/si4455-pic24-rf/trn/si4455_defs.h
#define SI4455_PROP_MATCH_MASK_4_MASK 0xFF
#define SI4455_PROP_MATCH_MASK_4_DEFAULT 0x00
#define SI4455_PROP_MATCH_MASK_4_MASK_4_SIZE 8
#define SI4455_PROP_MATCH_MASK_4_MASK_4_LSB 0
#define SI4455_PROP_MATCH_MASK_4_MASK_4_MSB 7
#define SI4455_PROP_MATCH_MASK_4_MASK_4_MIN 0
#define SI4455_PROP_MATCH_MASK_4_MASK_4_MAX 0xFF
#define SI4455_PROP_MATCH_MASK_4_MASK_4_MASK 0xFF

#define SI4455_PROP_MATCH_CTRL_4_MASK 0xFF
#define SI4455_PROP_MATCH_CTRL_4_DEFAULT 0x00
#define SI4455_PROP_MATCH_CTRL_4_POLARITY_SIZE 1
#define SI4455_PROP_MATCH_CTRL_4_POLARITY_LSB 7
#define SI4455_PROP_MATCH_CTRL_4_POLARITY_MSB 7
#define SI4455_PROP_MATCH_CTRL_4_POLARITY_MASK 0x80
#define SI4455_PROP_MATCH_CTRL_4_POLARITY_BIT 0x80
#define SI4455_PROP_MATCH_CTRL_4_LOGIC_SIZE 1
#define SI4455_PROP_MATCH_CTRL_4_LOGIC_LSB 6
#define SI4455_PROP_MATCH_CTRL_4_LOGIC_MSB 6
#define SI4455_PROP_MATCH_CTRL_4_LOGIC_MASK 0x40
#define SI4455_PROP_MATCH_CTRL_4_LOGIC_BIT 0x40
#define SI4455_PROP_MATCH_CTRL_4_OFFSET_SIZE 5
#define SI4455_PROP_MATCH_CTRL_4_OFFSET_LSB 0
#define SI4455_PROP_MATCH_CTRL_4_OFFSET_MSB 4
#define SI4455_PROP_MATCH_CTRL_4_OFFSET_MIN 0
#define SI4455_PROP_MATCH_CTRL_4_OFFSET_MAX 0x1F
#define SI4455_PROP_MATCH_CTRL_4_OFFSET_MASK 0x1F

#define SI4455_PROP_FREQ_CONTROL_INTE_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_INTE_DEFAULT 0x3C
#define SI4455_PROP_FREQ_CONTROL_INTE_INTE_SIZE 7
#define SI4455_PROP_FREQ_CONTROL_INTE_INTE_LSB 0
#define SI4455_PROP_FREQ_CONTROL_INTE_INTE_MSB 6
#define SI4455_PROP_FREQ_CONTROL_INTE_INTE_MIN 0
#define SI4455_PROP_FREQ_CONTROL_INTE_INTE_MAX 127
#define SI4455_PROP_FREQ_CONTROL_INTE_INTE_MASK 0x7F

#define SI4455_PROP_FREQ_CONTROL_FRAC_2_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_FRAC_2_DEFAULT 0x08
#define SI4455_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_SIZE 3
#define SI4455_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_LSB 0
#define SI4455_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MSB 2
#define SI4455_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MIN 0
#define SI4455_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MAX 7
#define SI4455_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MASK 0x7

#define SI4455_PROP_FREQ_CONTROL_FRAC_1_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_DEFAULT 0x00
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_SIZE 8
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_LSB 0
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MSB 7
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MIN 0
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MAX 255
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MASK 0xFF

#define SI4455_PROP_FREQ_CONTROL_FRAC_0_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_DEFAULT 0x00
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_SIZE 8
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_LSB 0
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MSB 7
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MIN 0
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MAX 255
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MASK 0xFF

#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_DEFAULT 0x00
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_SIZE 8
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_LSB 0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MSB 7
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MIN 0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MAX 255
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MASK 0xFF

#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_DEFAULT 0x00
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_SIZE 8
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_LSB 0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MSB 7
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MIN 0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MAX 255
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MASK 0xFF

#define SI4455_PROP_FREQ_CONTROL_W_SIZE_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_DEFAULT 0x20
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_SIZE 8
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_LSB 0
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MSB 7
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MIN 0
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MAX 255
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MASK 0xFF

#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_MASK 0xFF
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_DEFAULT 0xFF
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_SIZE 8
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_LSB 0
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MSB 7
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MIN -128
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MAX 127
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MASK 0xFF

#endif